//  0.Вывести квадрат числа**
Console.WriteLine("Введите число которое желаете возвести в квадрат");
double number = double.Parse(Console.ReadLine()!);
double sqr = number * number;
Console.WriteLine($"Квадрат числа {number} равен {sqr}");

